//  Функція створення slug із заголовка
function slugify(title) {
  // 1. Перетворюємо рядок у нижній регістр
  // 2. Видаляємо зайві пробіли
  // 3. Ділимо слова за пробілом
  // 4. Об’єднуємо слова через тире
  return title.toLowerCase().trim().split(/\s+/).join("-");
}

//  Перевірка роботи функції
console.log(slugify("Масиви для початківців")); // "масиви-для-початківців"
console.log(slugify("Англійська для розробника")); // "англійська-для-розробника"
console.log(slugify(" Десять секретів JavaScript")); // "десять-секретів-javascript"
console.log(slugify("Як - стати-ЮНІОР-розробником-за-ДВА-ТИЖНІ")); // "як-стати-юніор-розробником-за-два-тижні"
